{
    "https://mxb-mods.com/frozen-creek-mx-one-one-mx-r10/": {
        "url": "https://mxb-mods.com/frozen-creek-mx-one-one-mx-r10/",
        "title": "Frozen Creek MX (One-One MX R10)",
        "creator": "Dr.PhDeez",
        "downloads": {
            "by_type": {
                "other": []
            },
            "by_host": {
                "mediafire": [
                    "https://www.mediafire.com/file/4qpbkw2ns3xy7j7/Frozen_Creek_MX.pkz/file"
                ]
            }
        },
        "images": {
            "cover": "https://cdn.mxb-mods.com/wp-content/uploads/2024/11/thumb-jpg.webp",
            "additional": []
        },
        "description": "DescriptionDownloadsBring your jackets! We’re racing the final round of the One-One MX series in Anchorage, Alaska. If you want to race this track on Monday, Nov. 11, 2024, find the One-One server or myself on Discord and we’ll help get you signed up. We accept any level of rider, from beginner to pro, so don’t be shy.This track is entirely conceptual, built to look like a race-ready track after a bit of snowfall. The majority of the terrain is dirt with some mud and snow in some areas around the track, along with some areas that are completely snow or starting to melt. I spent countless hours on getting the textures to look realistic and change as they’re ridden on. The snow will look like its compacting down from the weight of the bike riding over it, while the dirt will start to look a little slick and muddy from the snow mixing with the dirt. Throw on some erode and it looks wonderful.This track isn’t too difficult, but features ruts and bumps, a few big sends, along with some technical areas and multiple line choices in the corners. It’s also been adapted and tested extensively to ride well with the new OEMS. Lastly, the snow has sand physics so it will pull the bike in and slow it down just as you’d expect.There’s been some recent reports from locals spotting Bigfoot and the Abominable Snowman in the area, so keep an eye out.Special thanks –One-One SMX SeriesNewSkool for doing the race data/camera/marshals and helping me ideate and build some of the trackLynds, RedRider, Resolute Kraken, AGMX, Giopanda, Mouk Lab, Kellz, Cody James, PHANTOMZ, TFC, Navo, L0wpoly and anyone else I forgot for their awesome tutorials, assets, and whatever else got me this point. Couldn’t have made this without you all!Track InfoSoil Types (track materials)Soft SoilDownloadsTotal downloads: 3498Made for Beta 19.Recommended MediafireDownload from mediafire.comhttps://www.mediafire.com/file/4qpbkw2ns3xy7j7/Frozen_Creek_MX.pkz/fileOptional Google DriveDownload from drive.google.comhttps://drive.google.com/file/d/1fuh-WhD2FY3yfevP5nnQzz3rHJs87uMu/view?usp=sharingMod Instructions (DEFAULT)Put the PKZ file or folder into your \"mods/tracks/*category*\" folder.",
        "embedded_videos": []
    },
    "https://mxb-mods.com/fort-red/": {
        "url": "https://mxb-mods.com/fort-red/",
        "title": "Fort Red",
        "creator": "RedRider197",
        "downloads": {
            "by_type": {
                "other": []
            },
            "by_host": {
                "mega": [
                    "https://mega.nz/file/r1FiVKhB#HHTYYDQlSVWFC9PvY5-ksjIQWcRgq7IG960G-x6gnTE",
                    "https://mega.nz/file/qpNF0DqQ#VRlZMXFZ33PfcOGZsMweEX3tE_NfliTdUi5YSOf41lU"
                ],
                "mediafire": [
                    "https://www.mediafire.com/file/mc30od0wla4xp7a/Fort_Red.pkz/file",
                    "https://www.mediafire.com/file/g88hmbiijqxnres/Fort_Red.pkz/file"
                ]
            }
        },
        "images": {
            "cover": "https://cdn.mxb-mods.com/wp-content/uploads/2023/09/FortDodge-Preview.gif",
            "additional": []
        },
        "description": "DescriptionDownloadsWelcome to Fort Red! (Fort Dodge round 2 from Reflex)I’m excited to finally finish a track project again for the community, it’s a combination of Reflex and MXB style where I tried to stay true to Reflex but in an MXB way. (tested with OEM bikes) If you like this track and start  thinking “I hope he makes more Reflex to MXB tracks” lol I’m just doing this one so, sorry in advance. I mostly got the itch to make the height map and then it just grew from there, making these stadiums is time consuming and I’ve got a lot more content to finish 🙂 So please enjoy and relive a little nostalgia from MvA Reflex.Preview/Edit   https://youtu.be/1YQ-4Tw6d1E?si=rAs8sObwHZlw3CPd CreditsEarthwurx Discord <3Dblu- tips for material thickness, whip video (main screen)Mulock- Tracked tutorial, Checking my centerline and race data <3JV- info/advice/assistance/optimizations <3Logan- Crowd Audio, lots of things and Friend <3ParaMoto-Gas Can Reference model.FluffyGecko for Ramp models Niko, Maplar, Kingmx,Mulock,Cody,Alpha,Calum anyone else that gave feedback on the beta 1 or 2 and QA testing (Fort Dodgin them spikes lol )If you want to you can donate money here http://paypal.me/redrider197 Thanks!Track InfoTrack ID: Fort RedDownloadsTotal downloads: 33539Made for Beta 18.Default Fort RedDownload from mega.nzhttps://mega.nz/file/r1FiVKhB#HHTYYDQlSVWFC9PvY5-ksjIQWcRgq7IG960G-x6gnTEDefault Fort RedDownload from mediafire.comhttps://www.mediafire.com/file/mc30od0wla4xp7a/Fort_Red.pkz/fileServer Version Fort Red (Server)Download from mediafire.comhttps://www.mediafire.com/file/g88hmbiijqxnres/Fort_Red.pkz/fileServer Version Fort Red (Server)Download from mega.nzhttps://mega.nz/file/qpNF0DqQ#VRlZMXFZ33PfcOGZsMweEX3tE_NfliTdUi5YSOf41lUMod Instructions (DEFAULT)Put the PKZ file or folder into your \"mods/tracks/*category*\" folder.Support RedRider197!Hey there! If you would like to support my work, just know all donations will go towards paying for programs I use to make mods. This is just a 2nd job/hobby type beat for me and donations are not expected. Cheers!Buy me a coffee!",
        "embedded_videos": []
    },
    "https://mxb-mods.com/lockdown-pro/": {
        "url": "https://mxb-mods.com/lockdown-pro/",
        "title": "Lockdown Pro",
        "creator": "Jones_797",
        "downloads": {
            "by_type": {
                "other": []
            },
            "by_host": {
                "mega": [
                    "https://mega.nz/file/7QhGVbTD#zT8Ckn7oxYpermD1SQF3DVhnJ75oKL7YLcPs9FCe9ZU",
                    "https://mega.nz/file/aQxyQB5T#EzNx6VIlfvPR9rEkbR6gEwxSwcZ3B7NNnXh-PK6nvIM"
                ]
            }
        },
        "images": {
            "cover": "https://cdn.mxb-mods.com/wp-content/uploads/2021/08/lockdown_pro_titelbild_Kopie-1240x1240.png",
            "additional": []
        },
        "description": "DescriptionDownloadsWelcome to my first track. Lockdown is a fantasy track i used it to learn trackbuilding for making some good replicas in futer. A shorter amateur version is planed in the next couple days. Objects like the bridges, houses, towers, startbanners are modelt by my own.If you like my work, donate me https://paypal.me/MXBcommercials?locale.x=de_DETrackperview from BoomerBarber:Trailer:I wanna say thanks to some people wich helped me with objects an knowledge: – Victor for the thumbnail  (not ingame yet) – Insane du geile Sau für deine Seite und sein Fachwissen – Giopanda for the basic Trackassets – Mouk Lab for the Team Trucks – Ginxma for the ambulance and other trucks – Agitato for the 100% Infaltable – Resolute for the Track Builder Helper – JV and Janes46 for beta testing – the whole community i used as helpcenter – all others i didn´t mention hereIt was a lot of hard work, i hope you enjoy the track. If there are some issues let me know please.DownloadsTotal downloads: 6869Default 797 Lockdown ProDownload from mega.nzhttps://mega.nz/file/7QhGVbTD#zT8Ckn7oxYpermD1SQF3DVhnJ75oKL7YLcPs9FCe9ZUServer Version 797 Lockdown Pro (Server Version)Download from mega.nzhttps://mega.nz/file/aQxyQB5T#EzNx6VIlfvPR9rEkbR6gEwxSwcZ3B7NNnXh-PK6nvIMMod Instructions (DEFAULT)Put the PKZ file or folder into your \"mods/tracks/*category*\" folder.",
        "embedded_videos": [
            "https://www.youtube.com/embed/KnuxmJC5sHM?feature=oembed",
            "https://www.youtube.com/embed/iDBq8ShyX0c?feature=oembed"
        ]
    }
}